Autodesk.Revit.DB.DirectContext3D.IndexPoint.GetSizeInShortInts
Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Returns:
The number of short integers occupied by the primitive.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexPoint.Index
The index of the point's vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexPoint.#ctor(System.Int32)
Constructs the point primitive.
index:
The index of the point's vertex.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexPoint
A point primitive consisting of one index.
Since:
2017